app/views/students/edit.html.erb

SELECT "school_classes".* FROM "school_classes"
---
  Last Name: <%= f.text_field :last_name %><br>
  <%= f.collection_select :school_class_id, SchoolClass.all, :id, :title %><br>