app/views/students/new.html.erb

  Last Name: <%= f.text_field :last_name %><br>
  <%= f.collection_select :school_class_id, SchoolClass.all, :id, :title %><br>
---
SELECT "school_classes".* FROM "school_classes"