app/controllers/students_controller.rb

  def create
    @student = Student.create(student_params(:first_name, :last_name, :school_class_id))
---
INSERT INTO "students" ("first_name", "last_name", "school_class_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Dan"], ["last_name", "Dan"], ["school_class_id", 2], ["created_at", "2019-04-26 17:29:58.231697"], ["updated_at", "2019-04-26 17:29:58.231697"]]

  def update
    @student = Student.find(params[:id])
    @student.update(student_params(:first_name, :last_name, :school_class_id))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Jeffrey"], ["last_name", "M A R K S"], ["updated_at", "2019-04-26 15:45:39.191522"], ["id", 1]]

  def destroy
    Student.find(params[:id]).destroy
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 6]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]